Revit 2027 API
gbXMLBuildingHVACSystem Enumeration
Note: This API is now obsolete.
 Enumerations for gbXML (Green Building XML) format, used for energy analysis, schema version 0.34.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit. Please use Autodesk.Revit.DB.Mechanical.ZoneEquipment instead.")]
public enum gbXMLBuildingHVACSystem
<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit. Please use Autodesk.Revit.DB.Mechanical.ZoneEquipment instead.")>
Public Enumeration gbXMLBuildingHVACSystem
[ObsoleteAttribute(L"Deprecated in Revit 2027 and may be removed in a later version of Revit. Please use Autodesk.Revit.DB.Mechanical.ZoneEquipment instead.")]
public enum class gbXMLBuildingHVACSystem
[<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit. Please use Autodesk.Revit.DB.Mechanical.ZoneEquipment instead.")>]
type gbXMLBuildingHVACSystem
Members
Member name | Value | Description
CentralVAVElectricResistanceHeatChillerFivePointNinetySixCOP | 4
CentralVAVHWHeatChillerFivePointNinetySixCOPBoilersEightyFourPoint5Eff | 2
ElevenPointThreeEERPackagedVAVEightyFourPointFourPercentBoilerHeating | 1
FourPipeFanCoilSystemChillerFivePointNinetySixCOPBoilersEightFourPointFiveEff | 3
NoOfHVACSystemEnums | 12
ResidentialFourteenSEEREightPointThreeHSPFSplitPackagedHeatPump | 11
ResidentialFourteenSEERPointNineAFUESplitPackagedGasLessThanFivePointFiveTon | 10
ResidentialSeventeenSEERNinePointSixHSPFSplitHPLessThanFivePointFiveTon | 8
TwelveSEEREightPointThreeHSPFPackagedTerminalHeatPumpPTAC | 7
TwelveSEERSevenPointSevenHSPFSplitPackagedHeatPump | 5
TwelveSEERSPointNineAFUESplitPackagedGasFiveToElevenTon | 0
TwoPipeFanCoilSystemChillerFivePointNinetySixCOPBoilersEightyFourPointFiveEff | 6
UnderfloorAirDistribution | 9
Remarks
 This enumeration corresponds to the HVAC System attribute in gbXML and is used to specify the Building HVAC System.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace